-- phpMyAdmin SQL Dump
-- version 5.0.3
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2020 年 12 月 09 日 03:30
-- 伺服器版本： 10.4.14-MariaDB
-- PHP 版本： 7.3.23

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `petliday`
--

-- --------------------------------------------------------

--
-- 資料表結構 `products`
--

CREATE TABLE `products` (
  `sid` int(11) NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `product_name1` varchar(255) NOT NULL,
  `product_name2` varchar(255) NOT NULL,
  `pd_short` varchar(255) NOT NULL,
  `pd_area` varchar(255) DEFAULT NULL,
  `cate` varchar(255) NOT NULL,
  `time` varchar(255) NOT NULL,
  `area` varchar(255) NOT NULL,
  `price_man` varchar(255) NOT NULL,
  `price_pet` varchar(255) NOT NULL,
  `price_all` varchar(255) NOT NULL,
  `star` varchar(255) NOT NULL,
  `rate` varchar(255) NOT NULL,
  `intro` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `products`
--

INSERT INTO `products` (`sid`, `product_name`, `product_name1`, `product_name2`, `pd_short`, `pd_area`, `cate`, `time`, `area`, `price_man`, `price_pet`, `price_all`, `star`, `rate`, `intro`) VALUES
(5, '柴犬大集合遊台中｜彩虹眷村＆ 豐富公園跑跑跳跳心情好二日遊', '柴犬大集合遊台中｜彩虹眷村＆', '豐富公園跑跑跳跳心情好二日遊', '台中二日遊', '中部出發', '2', '48hr', 'c', '900', '500', '1400', '4.9', '273', '柴犬爸家們集合！一起猖狂遊台中景點，一起打破世界紀錄吧！'),
(6, '狗來富｜帶寵物同旅遊紫南宮＆玩遍深度探索南投風情三日遊', '狗來富｜帶寵物同旅遊紫南宮＆', '玩遍深度探索南投風情三日遊', '南投三日遊', '中部出發', '3', '72hr', 'c', '1888', '888', '2776', '4.6', '325', '戴上家中的富貴寵物，一同遊南投紫南宮，毛日獨家贈送寵物護身符，把富貴帶回家。'),
(12, '與寶貝一起玩水之消暑不曬黑｜寵物友善森林水上遊樂區嗨翻天一日遊', '', '', '中部一日遊', '中部出發', '1', '8hr', 'c', '760', '350', '1110', '4.9', '124', '全園區皆能戴上寵物一起玩，森林擁有各式水上遊樂設施，專車接送，無煩惱旅行。'),
(13, 'GQ X 毛日｜毛爸毛媽動身嘍！快來參加寵物有善草地市集野餐日', '', '', '野餐一日遊', '中部出發', '1', '8hr', 'c', '900', '200', '1100', '4.7', '134', '毛日年度聯名活動，在華山大草原上與寵物一起野餐，當日還有課種體驗活動！'),
(26, '誰是最厲害的狗狗！｜寵物親子趣味競賽三合一一日活動', '', '', '趣味競賽', '中部出發', '4', '5hr', 'c', '399', '400', '799', '4.6', '67', '本次活動特別規劃了三場的寵物趣味競賽，歡迎市民朋友帶著毛小孩們一同共襄盛舉。'),
(29, '苗栗樂活古風行｜南庄老街 & 景觀莊園 & 寵物主題旅館二日遊', '', '', '苗栗二日遊', '中部出發', '2', '48hr', 'c', '2450', '1000', '3450', '4.5', '29', '民宿在南庄山區占地寬廣，帶著狗狗旅行輕鬆安心愜意，還可與狗友們交流照顧心得。'),
(33, '毛孩的新樂園｜水管屋寵物樂園：南投右下四角村寵物樂活一日遊', '', '', '樂園一日遊', '中部出發', '1', '8hr', 'c', '1520', '980', '2500', '4.8', '109', '「右下四角村」樂園皆以狗狗們為出發點，還有讓主人能跟寵物同住的粉嫩繽紛水管屋。'),
(1, '上山下海玩得夠！｜熱氣球＆SUP＆金針花海 花東包車三日遊', '上山下海玩得夠！｜熱氣球＆', 'SUP＆金針花海 花東包車三日遊', '花東三日遊', '東部出發', '3', '48hr', 'e', '3280', '1000', '4280', '5.0', '178', '六十石山、赤科山、太麻里山為花東縱谷三大金針栽植區，賞金針花海的好去處。'),
(22, '東部樂活綠油行｜台東伯朗大道 & 初鹿牧場親近自然放鬆眼睛二日遊', '', '', '東部二日遊', '東部出發', '2', '48hr', 'e', '2980', '1200', '4180', '4.6', '192', '沿海處處是美景，山川壯麗美不勝收，得天獨厚大自然的資源豐富，連假放鬆的美好去處'),
(23, '和寵物沁涼一夏｜澎湖玄武岩 & 七美雙心石滬經典必去景點三日遊', '', '', '澎湖三日遊', '東部出發', '3', '72hr', 'e', '4270', '1800', '6070', '4.8', '38', '現在訂購沙灘透明獨木舟 / SUP 行程，由專業教練帶領體驗，與毛小孩一同划舟'),
(2, '你的瑜伽完美拍檔｜寵物也能完成的瑜伽 寵物初階瑜伽互動課程', '你的瑜伽完美拍檔｜寵物也能 ', '完成的瑜伽 寵物初階瑜伽互動課程', '瑜伽課程', '北部出發', '4', '3hr', 'n', '1140', '400', '1540', '4.8', '112', '寵物瑜伽：主人主動，狗狗被動。在瑜伽裡聲音是一種緩慢有規律的震動，會讓心平穩。'),
(4, '一起奔跑吧｜宜蘭露營 & 夜間觀星行程自由自在舒爽二日遊', '一起奔跑吧｜宜蘭露營 & 夜間觀星', '自由自在舒爽二日遊', '宜蘭二日遊', '北部出發', '2', '48hr', 'n', '1200', '800', '2000', '4.8', '200', '專人搭收所有設備！帶著簡單行李就能出發，體驗宜蘭在山谷中露營。'),
(7, '帶寵物遊澎湖｜ 菊島海產吃到痛風爽到發瘋二日遊（高雄出發）', '帶寵物遊澎湖｜ 菊島海產吃到痛風', '爽到發瘋二日遊（高雄出發）', '澎湖二日遊', '南部出發', '2', '48hr', 'n', '3650', '1800', '5450', '4.9', '442', '冬天的澎湖菊島也很精彩！帶上寵物走訪各大夢幻打卡點。'),
(9, 'busy歹吧郎ㄉ選擇｜陽明山二子坪＆熊空茶園一日遊', 'busy歹吧郎ㄉ選擇｜陽明山二', '子坪＆熊空茶園一日遊', '陽明山一日遊', '北部出發', '1', '8hr', 'n', '1500', '900', '2400', '4.8', '56', '寵物就是我男/女友！？帶上他們一起漫步陽明山與山峽台灣農林熊空茶園。'),
(10, '北市街拍｜專業司機包車載著你與毛小孩遊遍網美打卡景點一日遊', '北市街拍｜專業司機包車載著你', '與毛小孩遊遍網美打卡景點一日遊', '北市一日遊', '北部出發', '1', '8hr', 'n', '666', '360', '1026', '4.6', '434', '專業網紅帶領，台北各大網紅爭相打卡的私密景點，千萬不可錯過！'),
(11, '踏浪星辰露營｜寵物友善豪華露營懶人也能輕鬆體驗花蓮二日遊', '踏浪星辰露營｜寵物友善豪華露營', '懶人也能輕鬆體驗花蓮二日遊', '花蓮二日遊', '東部出發', '2', '48hr', 'n', '3200', '1260', '4460', '4.9', '234', '在花蓮無光害星海下入睡，早晨讓蟲鳴鳥叫喚醒，來趟放鬆身心靈的自然之旅。'),
(14, '[ 毛日獨家 ] 寵物老是搗亂讓你又愛又氣嗎？｜寵物行為養成訓練速成課', '[ 毛日獨家 ] 寵物老是搗亂讓你又愛又氣嗎？', '[ 毛日獨家 ] 寵物老是搗亂讓你又愛又氣嗎？', '養成訓練課', '北部出發', '4', '4hr', 'n', '200', '600', '800', '4.8', '642', '由台大動物學教授暨寵物訓練師聯盟【偉偉老師】授課，了解毛寶貝的肢體語言。'),
(15, '[ 毛日好評 ] 寵物服裝DIY課｜零基礎沒問題！從打版教起適合新手毛爸媽們', '[ 毛日好評 ] 寵物服裝DIY課｜零基礎沒問題！從', '從打版教起適合新手毛爸媽們', '服裝課程', '北部出發', '4', '4hr', 'n', '1400', '100', '1500', '5.0', '452', '自己親手做的獨一無二，20年服裝經驗老師現場教學，新手也能快速上手！'),
(16, '寵物油畫｜與毛孩共同創作還能掛在家裡擺飾一舉兩得｜ Wendy老師授課', '寵物油畫｜與毛孩共同創作還能掛在家裡', '擺飾一舉兩得｜ Wendy老師授課', '油畫課程', '北部出發', '4', '2.5hr', 'n', '1150', '200', '1350', '4.8', '353', '毛小孩自己畫！帶毛孩一起來初體驗：主人當小畫家，寵物美容水噹噹！'),
(17, '[ 毛日獨家 ] 寵物放鬆精油調製｜由專業寵物香氛師及訓練師帶領的精油氣味課', '[ 毛日獨家 ] 寵物放鬆精油調製｜由專業寵物香氛師', '及訓練師帶領的精油氣味課', '香氛課程', '北部出發', '4', '2hr', 'n', '1200', '300', '1500', '4.9', '56', '現場調製出1 瓶適合自己與寵物的精油（30ml），讓放鬆香味回韻在家中。'),
(18, '聖誕老公公都想吃的寵物餅乾｜與毛家長們一起製作自己寶貝的造型餅乾', '聖誕老公公都想吃的寵物餅乾｜與毛家長', '們一起製作自己寶貝的造型餅乾', '寵物餅乾課程', '北部出發', '4', '4hr', 'n', '550', '100', '650', '4.7', '262', '十二月幸福季節， 不可少的寵物造型聖誕餅乾DIY限時開課！'),
(19, '跨年party寵物不孤單｜寵物一起加入瘋跨年全家一起嗨明天才會嗨', '跨年party寵物不孤單｜寵物一起', '加入瘋跨年全家一起嗨明天才會嗨', '跨年活動', '北部出發', '4', '8hr', 'n', '1600', '600', '2200', '4.8', '183', '不需人擠人！直接包下信義區CR&G 78樓觀景台帶上心愛寵物一起跨年。'),
(20, '[ 熱烈招生中 ] 動手做食器 ｜寵物也能一同參與的寵物食器 DIY 活動課程', '[ 熱烈招生中 ] 動手做食器 ｜寵物也能一同', '參與的寵物食器 DIY 活動課程', '食器課程', '北部出發', '4', '3hr', 'n', '1280', '300', '1580', '4.8', '74', '立即預約peliday毛孩教室，專業師傅教學帶領製作陶瓷食器，適合親子一起體驗'),
(21, '你就是寵物的大廚｜寵物鮮食烹飪 & 營養知識教學課程｜ Jimmy老師授課', '你就是寵物的大廚｜寵物鮮食烹飪 & ', '營養知識教學課程｜ Jimmy老師授課', '烹飪課程', '北部出發', '4', '3hr', 'n', '990', '300', '1290', '4.9', '209', '透過營養師協助規劃後的鮮食，幫助飼主在家也能輕鬆備餐，寶貝天天吃得健康美味又營養'),
(24, '寵物陪你血拼到手軟｜桃園華泰名品城 & 春天農場豐富一日遊', '寵物陪你血拼到手軟｜桃園華泰名品城 &', '春天農場豐富一日遊', '血拼一日遊', '北部出發', '1', '8hr', 'n', '780', '300', '1080', '4.8', '174', '帶你探索華泰名品城的各式生活主題，與毛孩也能輕鬆愉悅地享受購物樂趣。'),
(27, '陪你過假日｜基隆和平島公園野餐 & 市集 & 講座 & 音樂會', '陪你過假日｜基隆和平島公園野餐 & ', '陪你過假日｜基隆和平島公園野餐 & ', '基隆一日遊', '北部出發', '4', '8hr', 'n', '680', '600', '1280', '4.3', '98', '在大自然的擁抱下，聆聽毛孩音樂、逛逛選物市集，只要和毛孩一起，做什麼都好快樂！'),
(28, '北海岸必去打卡點｜陰陽海＆老梅綠石槽＆象鼻岩一日遊', '北海岸必去打卡點｜陰陽海＆', '老梅綠石槽＆象鼻岩一日遊', '北海岸一日遊', '北部出發', '1', '10hr', 'n', '890', '400', '1290', '4.5', '239', '包車漫遊台灣北海岸，輕鬆遊走於北海岸熱門網拍景點如老梅綠石槽、鼻頭角和陰陽海'),
(31, '毛孩生日快樂！｜專為你家寶貝安排的寵物壽星派對活動', '毛孩生日快樂！｜專為你家寶貝安排', '的寵物壽星派對活動', '生日活動', '北部出發', '4', '3hr', 'n', '499', '777', '1276', '4.9', '398', '生日派對讓寵物備感關愛和重視，蛋糕口味可依毛孩所需的營養及需求設計。'),
(32, '寵物也能體驗的異國風情｜宜蘭南方澳內埤海 & 三奇村二日遊', '寵物也能體驗的異國風情｜宜蘭南方澳', '內埤海 & 三奇村二日遊', '宜蘭二日遊', '北部出發', '2', '48hr', 'n', '3120', '1200', '4320', '4.5', '222', '台東有金城武樹的伯朗大道，宜蘭冬山鄉三奇村也有一條無電線桿的「宜蘭伯朗大道」'),
(3, '高雄寵物友善｜駁二草原盡情拍美照 & 狗民小學郊遊踏青參訪一日遊', '高雄寵物友善｜駁二草原盡情拍美照 & ', ' 狗民小學郊遊踏青參訪一日遊', '高雄一日遊', '南部出發', '1', '8hr', 's', '500', '200', '700', '4.8', '46', '活力豐沛駁二藝術特區是全台唯一有輕軌通過的文創園區，一起草原上奔跑拍照。'),
(8, '帶寵物高雄｜熱門打卡路線旗津老街＆愛河愛之船海陸雙吃二日遊', '帶寵物高雄｜熱門打卡路線旗津', '老街＆愛河愛之船海陸雙吃二日遊', '高雄二日遊', '南部出發', '2', '48hr', 's', '2560', '1480', '4040', '4.9', '124', '就是要跟寵物醬玩高雄，熱銷高雄經典行程，旅行專車與專業導遊，放心遊玩！'),
(25, '手牽狗去散步｜墾丁龍磐公園 & 小巴里島岩一靜一動剛剛好一日遊', '手牽狗去散步｜墾丁龍磐公園 & ', '小巴里島岩一靜一動剛剛好一日遊', '墾丁一日遊', '南部出發', '1', '8hr', 's', '999', '600', '1599', '4.3', '88', '放假來屏東一日遊玩，屏東有哪些好玩的地方，來趟屏東輕旅行感受一下在地的自然風光。'),
(30, '狗狗也想當網美｜台南藍晒圖文創園區 & 台江國家公園三日遊', '狗狗也想當網美｜台南藍晒圖文創園區 &', ' 台江國家公園三日遊', '台江三日遊', '南部出發', '3', '72hr', 's', '4780', '1360', '6140', '4.9', '75', '巴克禮公園是台南之肺，公園裡常見到主人帶著毛孩散步在林間，如國外景致般的悠閒。'),
(34, '帶著毛孩購物趣｜高雄寵物展 & 網美咖啡廳輕鬆悠閒文青一日遊', '帶著毛孩購物趣｜高雄寵物展 & ', '網美咖啡廳輕鬆悠閒文青一日遊', '高雄一日遊', '南部出發', '1', '6hr', 's', '650', '500', '1150', '4.2', '95', '集結各大寵物商聯手下殺，飼料、玩具、保健用品一應俱全！快帶毛小孩一起來玩吧！');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products`
--
ALTER TABLE `products`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
