-- phpMyAdmin SQL Dump
-- version 5.0.3
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2020 年 12 月 11 日 04:30
-- 伺服器版本： 10.4.14-MariaDB
-- PHP 版本： 7.3.23

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `petliday`
--

-- --------------------------------------------------------

--
-- 資料表結構 `index-quiz`
--

CREATE TABLE `index-quiz` (
  `sid` int(11) NOT NULL,
  `question` varchar(255) NOT NULL,
  `a` varchar(255) NOT NULL,
  `b` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `index-quiz`
--

INSERT INTO `index-quiz` (`sid`, `question`, `a`, `b`) VALUES
(1, '請問飼主是室內派還是戶外派呢？', '室內派', '戶外派'),
(2, '請問毛孩較為喜歡靜態活動還是動態活動呢？', '喜歡待在家自己找東西玩，或和熟悉的人玩樂\r\n', '喜歡在外面奔跑，對其他陌生人狗不怕生'),
(3, '寵物是否有疾病', '是', '否');

-- --------------------------------------------------------

--
-- 資料表結構 `member-wishlist`
--

CREATE TABLE `member-wishlist` (
  `sid` int(11) NOT NULL,
  `prod_id` int(11) NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `active` varchar(255) NOT NULL,
  `member_sid` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `member-wishlist`
--

INSERT INTO `member-wishlist` (`sid`, `prod_id`, `product_name`, `active`, `member_sid`) VALUES
(9, 3, '柴犬大集合遊台中｜彩虹眷村＆ 豐富公園二日遊', '1', 23),
(22, 2, '一起奔跑吧｜宜蘭露營＋夜間觀星行程二日遊', '1', 23),
(24, 7, 'busy歹吧郎ㄉ選擇｜陽明山二子坪＆熊空茶園一日遊', '1', 23),
(25, 5, '帶寵物遊澎湖｜ 菊島二日遊（高雄出發）', '1', 23);

-- --------------------------------------------------------

--
-- 資料表結構 `member_avatar`
--

CREATE TABLE `member_avatar` (
  `sid` int(11) NOT NULL,
  `id` varchar(255) DEFAULT NULL,
  `profile_image` mediumtext DEFAULT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `mobile` varchar(255) DEFAULT NULL,
  `birthday` date DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `member_avatar`
--

INSERT INTO `member_avatar` (`sid`, `id`, `profile_image`, `email`, `password`, `mobile`, `birthday`, `name`, `address`) VALUES
(1, 'boy123', NULL, 'boy123@petliday.com', 'test123', '908512320', '1995-12-05', '柯基裘', '台北市信義區大榮星街195巷28號10樓'),
(2, 'girl456', NULL, 'girl456@petliday.com', 'test456', '998513275', '1963-09-10', '戴啵啵', '花蓮縣花蓮市國盛三街233號8樓'),
(3, 'pity0507', NULL, 'pity0507@petliday.com', 'test789', '905289518', '1982-06-08', '黎筱霈', '台南市東區弘勤路2段33弄2號5樓'),
(22, NULL, NULL, 'boy123@petliday.com', 'test123', NULL, NULL, 'User', NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `member_orders`
--

CREATE TABLE `member_orders` (
  `sid` int(11) NOT NULL,
  `member_sid` int(11) NOT NULL,
  `man_quantity` int(11) NOT NULL,
  `pet_quantity` int(11) NOT NULL,
  `mainLastName` varchar(255) NOT NULL,
  `mainFirstName` varchar(255) NOT NULL,
  `mainGender` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `amoumt` int(11) NOT NULL,
  `order_date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `member_orders`
--

INSERT INTO `member_orders` (`sid`, `member_sid`, `man_quantity`, `pet_quantity`, `mainLastName`, `mainFirstName`, `mainGender`, `phone`, `email`, `amoumt`, `order_date`) VALUES
(1, 1, 0, 0, '', '', '', '', '', 1000, '2019-08-08'),
(2, 1, 0, 0, '', '', '', '', '', 2500, '2020-07-02'),
(3, 1, 0, 0, '', '', '', '', '', 3300, '2020-06-28');

-- --------------------------------------------------------

--
-- 資料表結構 `member_pet`
--

CREATE TABLE `member_pet` (
  `sid` int(11) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 NOT NULL,
  `breed` varchar(255) CHARACTER SET utf8 NOT NULL,
  `age` int(11) NOT NULL,
  `birthday` date NOT NULL,
  `member_sid` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `member_pet`
--

INSERT INTO `member_pet` (`sid`, `name`, `breed`, `age`, `birthday`, `member_sid`) VALUES
(1, '嘟寶', '米格魯', 10, '2010-01-22', 1),
(2, 'Qbone', '柴犬', 1, '2019-09-10', 1),
(3, '黑糖', '米克斯', 6, '2014-05-05', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `order-man`
--

CREATE TABLE `order-man` (
  `sid` int(11) NOT NULL,
  `orderDetailsSid` int(11) NOT NULL,
  `prod-sid` int(11) DEFAULT NULL,
  `Name` varchar(255) NOT NULL,
  `man-phone` varchar(255) NOT NULL,
  `idCard` varchar(255) NOT NULL,
  `birthday` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `order-man`
--

INSERT INTO `order-man` (`sid`, `orderDetailsSid`, `prod-sid`, `Name`, `man-phone`, `idCard`, `birthday`) VALUES
(1, 46, NULL, '陳嘉偉', '0945-362-746', 'A135648385', '1985-10-03'),
(2, 46, NULL, '孔瑜琳', '0977-369-717', 'H263482385', '1989-01-16'),
(3, 46, NULL, '陳嘉偉', '0945-362-746', 'A135648385', '1985-10-03'),
(4, 46, NULL, '孔瑜琳', '0977-369-717', 'H263482385', '1989-01-16'),
(5, 62, 15, '陳嘉偉', '0945-362-746', 'A135648385', '1985-10-03'),
(6, 62, 15, '孔瑜琳', '0977-369-717', 'H263482385', '1989-01-16'),
(7, 62, 17, '陳嘉偉', '0945-362-746', 'A135648385', '1985-10-03'),
(8, 64, 15, '陳嘉偉', '0945-362-746', 'A135648385', '1985-10-03'),
(9, 64, 15, '孔瑜琳', '0977-369-717', 'H263482385', '1989-01-16'),
(10, 64, 17, '陳嘉偉', '0945-362-746', 'A135648385', '1985-10-03'),
(11, 66, 15, '陳嘉偉', '0945-362-746', 'A135648385', '1985-10-03'),
(12, 66, 15, '孔瑜琳', '0977-369-717', 'H263482385', '1989-01-16'),
(13, 66, 17, '陳嘉偉', '0945-362-746', 'A135648385', '1985-10-03'),
(14, 67, 4, '陳嘉偉', '0945-362-746', 'A135648385', '1985-10-03'),
(15, 68, 4, '陳嘉偉', '0945-362-746', 'A135648385', '1985-10-03'),
(16, 68, 4, '孔瑜琳', '0977-369-717', 'H263482385', '1989-01-16'),
(17, 69, 15, '陳嘉偉', '0945-362-746', 'A135648385', '1985-10-03'),
(18, 69, 15, '孔瑜琳', '0977-369-717', 'H263482385', '1989-01-16'),
(19, 70, 4, '陳嘉偉', '0945-362-746', 'A135648385', '1985-10-03'),
(20, 70, 4, '孔瑜琳', '0977-369-717', 'H263482385', '1989-01-16');

-- --------------------------------------------------------

--
-- 資料表結構 `order-pet`
--

CREATE TABLE `order-pet` (
  `sid` int(11) NOT NULL,
  `orderDetailsSid` int(11) NOT NULL,
  `prod-sid` int(11) DEFAULT NULL,
  `petName` varchar(255) NOT NULL,
  `petSize` varchar(255) NOT NULL,
  `notes` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `order-pet`
--

INSERT INTO `order-pet` (`sid`, `orderDetailsSid`, `prod-sid`, `petName`, `petSize`, `notes`) VALUES
(1, 66, 15, '嘿蹦', '小型犬', '希望能提供推車'),
(2, 66, 15, '球球', '中型犬', '狗狗有皮膚問題，提供的食物需要避免麥類'),
(3, 66, 17, '嘿蹦', '小型犬', '希望能提供推車'),
(4, 67, 4, '嘿蹦', '小型犬', '希望能提供推車'),
(5, 67, 4, '球球', '中型犬', '狗狗有皮膚問題，提供的食物需要避免麥類'),
(6, 68, 4, '嘿蹦', '小型犬', '希望能提供推車'),
(7, 68, 4, '球球', '中型犬', '狗狗有皮膚問題，提供的食物需要避免麥類'),
(8, 69, 15, '嘿蹦', '小型犬', '希望能提供推車'),
(9, 69, 15, '球球', '中型犬', '狗狗有皮膚問題，提供的食物需要避免麥類'),
(10, 70, 4, '嘿蹦', '小型犬', '希望能提供推車');

-- --------------------------------------------------------

--
-- 資料表結構 `order_details`
--

CREATE TABLE `order_details` (
  `sid` int(11) NOT NULL,
  `order_sid` int(11) NOT NULL,
  `product_sid` int(11) NOT NULL,
  `price_all` int(11) NOT NULL,
  `quantity_man` int(11) NOT NULL,
  `quantity_pet` int(11) NOT NULL,
  `go-date` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `order_details`
--

INSERT INTO `order_details` (`sid`, `order_sid`, `product_sid`, `price_all`, `quantity_man`, `quantity_pet`, `go-date`) VALUES
(3, 1, 12, 490, 1, 1, NULL),
(4, 64218, 4, 3334, 2, 1, NULL),
(5, 2020126638, 32, 4280, 3, 1, NULL),
(6, 2020126638, 22, 4280, 2, 1, NULL),
(7, 2020126642, 32, 4280, 3, 1, NULL),
(8, 2020126642, 22, 4280, 2, 1, NULL),
(9, 2020126643, 32, 4280, 3, 1, NULL),
(10, 2020126643, 22, 4280, 2, 1, NULL),
(11, 2020126645, 9, 4280, 5, 5, NULL),
(12, 2020126646, 9, 4280, 1, 1, NULL),
(13, 2020126647, 9, 4280, 1, 1, NULL),
(14, 2020126648, 9, 4280, 1, 1, NULL),
(15, 2020126649, 9, 4280, 1, 1, NULL),
(16, 2020126650, 9, 4280, 1, 1, NULL),
(17, 2020126651, 9, 4280, 1, 1, NULL),
(18, 2020126652, 9, 4280, 1, 1, NULL),
(19, 2020126653, 9, 4280, 1, 1, NULL),
(20, 2020126654, 9, 4280, 1, 1, NULL),
(21, 2020126655, 9, 4280, 1, 1, NULL),
(22, 2020126656, 9, 4280, 1, 1, NULL),
(23, 2020126657, 9, 4280, 1, 1, NULL),
(24, 2020126658, 9, 4280, 1, 1, NULL),
(25, 2020126659, 9, 4460, 1, 1, NULL),
(26, 2020126659, 2, 2000, 2, 1, NULL),
(27, 2020126660, 9, 4280, 1, 1, NULL),
(28, 2020126661, 9, 4280, 1, 1, NULL),
(29, 2020126662, 9, 4460, 1, 1, NULL),
(30, 2020126662, 2, 2000, 2, 1, NULL),
(31, 2020126663, 15, 1500, 2, 1, NULL),
(32, 2020126663, 17, 1500, 2, 1, NULL),
(33, 2020126664, 15, 4280, 2, 1, NULL),
(34, 2020126664, 17, 4280, 2, 1, NULL),
(35, 2020126665, 15, 4280, 2, 1, NULL),
(36, 2020126665, 17, 4280, 2, 1, NULL),
(37, 2020126666, 15, 4280, 2, 1, NULL),
(38, 2020126666, 17, 4280, 2, 1, NULL),
(39, 2020126667, 15, 4280, 2, 1, NULL),
(40, 2020126667, 17, 4280, 2, 1, NULL),
(41, 2020126668, 15, 4280, 2, 1, NULL),
(42, 2020126668, 17, 4280, 2, 1, NULL),
(43, 2020126669, 15, 4280, 2, 1, NULL),
(44, 2020126669, 17, 4280, 2, 1, NULL),
(45, 2020126670, 15, 4280, 2, 1, NULL),
(46, 2020126670, 17, 4280, 2, 1, NULL),
(47, 2020126671, 15, 4280, 2, 1, NULL),
(48, 2020126671, 17, 4280, 2, 1, NULL),
(49, 2020126672, 15, 3180, 2, 2, NULL),
(50, 2020126672, 17, 3180, 1, 1, NULL),
(51, 2020126673, 15, 3180, 2, 2, NULL),
(52, 2020126673, 17, 3180, 1, 1, NULL),
(53, 2020126674, 15, 3180, 2, 2, NULL),
(54, 2020126674, 17, 3180, 1, 1, NULL),
(55, 2020126675, 15, 3180, 2, 2, NULL),
(56, 2020126675, 17, 3180, 1, 1, NULL),
(57, 2020126676, 15, 3180, 2, 2, NULL),
(58, 2020126676, 17, 3180, 1, 1, NULL),
(59, 2020126677, 15, 3180, 2, 2, NULL),
(60, 2020126677, 17, 3180, 1, 1, NULL),
(61, 2020126678, 15, 3180, 2, 2, NULL),
(62, 2020126678, 17, 3180, 1, 1, NULL),
(63, 2020126679, 15, 3180, 2, 2, NULL),
(64, 2020126679, 17, 3180, 1, 1, NULL),
(65, 2020126680, 15, 3180, 2, 2, NULL),
(66, 2020126680, 17, 3180, 1, 1, NULL),
(67, 2020126681, 4, 2800, 1, 2, NULL),
(68, 2020126682, 4, 4000, 2, 2, NULL),
(69, 2020126683, 15, 3000, 2, 2, NULL),
(70, 2020126684, 4, 3200, 2, 1, 1);

-- --------------------------------------------------------

--
-- 資料表結構 `order_list`
--

CREATE TABLE `order_list` (
  `sid` int(11) NOT NULL,
  `coupon` varchar(255) DEFAULT NULL,
  `items` int(11) NOT NULL,
  `mainLastName` varchar(255) NOT NULL,
  `mainFirstName` varchar(255) NOT NULL,
  `mainGender` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `amount` int(11) NOT NULL,
  `member_sid` int(11) NOT NULL,
  `order_date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `order_list`
--

INSERT INTO `order_list` (`sid`, `coupon`, `items`, `mainLastName`, `mainFirstName`, `mainGender`, `phone`, `email`, `amount`, `member_sid`, `order_date`) VALUES
(7661, '1', 1, '1', '1', '1', '1', '1', 1, 1, '2020-12-03 12:26:37'),
(2020126623, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 7776, 7776, '2020-12-03 12:29:59'),
(2020126624, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 7776, 7776, '2020-12-03 12:31:59'),
(2020126625, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 7776, 7776, '2020-12-03 14:05:14'),
(2020126626, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 7776, 7776, '2020-12-03 14:08:44'),
(2020126627, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 19:46:59'),
(2020126628, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 19:49:27'),
(2020126629, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 19:49:29'),
(2020126630, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 19:49:40'),
(2020126631, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 19:50:02'),
(2020126632, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 19:51:09'),
(2020126633, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 19:51:11'),
(2020126634, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 19:51:16'),
(2020126635, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 19:51:32'),
(2020126636, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 19:53:25'),
(2020126637, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 19:53:26'),
(2020126638, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 19:54:15'),
(2020126639, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 19:57:09'),
(2020126640, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 19:57:20'),
(2020126641, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 20:00:41'),
(2020126642, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-03 20:03:15'),
(2020126643, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 9936, 9936, '2020-12-04 11:41:51'),
(2020126644, '2020WELCOME', 2, '', '', '0', '', '', 11440, 11440, '2020-12-06 22:08:56'),
(2020126645, '2020WELCOME', 2, '', '', '0', '', '', 22300, 22300, '2020-12-09 16:06:22'),
(2020126646, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 6128, 6128, '2020-12-10 19:33:40'),
(2020126647, '2020WELCOME', 2, '', '', '0', '', '', 7660, 7660, '2020-12-10 19:58:12'),
(2020126648, '2020WELCOME', 2, '', '', '0', '', '', 7660, 7660, '2020-12-10 19:58:14'),
(2020126649, '2020WELCOME', 2, '', '', '0', '', '', 7660, 7660, '2020-12-10 20:00:51'),
(2020126650, '2020WELCOME', 2, '', '', '0', '', '', 7660, 7660, '2020-12-10 20:03:45'),
(2020126651, '2020WELCOME', 2, '', '', '0', '', '', 7660, 7660, '2020-12-10 20:04:53'),
(2020126652, '2020WELCOME', 2, '', '', '0', '', '', 7660, 7660, '2020-12-10 20:12:00'),
(2020126653, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 6128, 6128, '2020-12-10 20:17:34'),
(2020126654, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 6128, 6128, '2020-12-10 20:17:37'),
(2020126655, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 6128, 6128, '2020-12-10 20:17:48'),
(2020126656, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 6128, 6128, '2020-12-10 20:20:26'),
(2020126657, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 6128, 6128, '2020-12-10 20:20:30'),
(2020126658, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 6128, 6128, '2020-12-10 20:23:05'),
(2020126659, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 6128, 6128, '2020-12-10 20:29:46'),
(2020126660, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 6128, 6128, '2020-12-10 20:30:09'),
(2020126661, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 6128, 6128, '2020-12-10 20:31:54'),
(2020126662, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 6128, 6128, '2020-12-10 20:32:06'),
(2020126663, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 5600, 5600, '2020-12-10 22:33:09'),
(2020126664, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 5600, 5600, '2020-12-10 22:34:03'),
(2020126665, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 5600, 5600, '2020-12-10 22:37:19'),
(2020126666, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 5600, 22, '2020-12-10 22:37:57'),
(2020126667, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 5600, 22, '2020-12-10 22:41:22'),
(2020126668, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 5600, 22, '2020-12-10 22:55:04'),
(2020126669, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 5600, 22, '2020-12-10 23:26:56'),
(2020126670, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 5600, 22, '2020-12-10 23:27:13'),
(2020126671, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 5600, 22, '2020-12-10 23:34:13'),
(2020126672, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 3600, 22, '2020-12-10 23:53:29'),
(2020126673, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 3600, 22, '2020-12-10 23:54:41'),
(2020126674, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 3600, 22, '2020-12-10 23:54:43'),
(2020126675, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 3600, 22, '2020-12-10 23:55:30'),
(2020126676, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 3600, 22, '2020-12-10 23:55:32'),
(2020126677, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 3600, 22, '2020-12-10 23:56:08'),
(2020126678, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 3600, 22, '2020-12-10 23:56:33'),
(2020126679, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 3600, 22, '2020-12-11 00:01:54'),
(2020126680, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 3600, 22, '2020-12-11 00:03:58'),
(2020126681, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 2800, 22, '2020-12-11 01:05:46'),
(2020126682, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 3200, 22, '2020-12-11 02:35:24'),
(2020126683, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 2400, 22, '2020-12-11 02:38:55'),
(2020126684, '2020WELCOME', 2, '陳', '嘉偉', 'man', '0945-362-746', 'rich184@gmail.com', 3200, 22, '2020-12-11 03:46:07');

-- --------------------------------------------------------

--
-- 資料表結構 `pd_area`
--

CREATE TABLE `pd_area` (
  `sid` int(11) NOT NULL,
  `area` varchar(255) NOT NULL,
  `area_sid` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `pd_area`
--

INSERT INTO `pd_area` (`sid`, `area`, `area_sid`) VALUES
(1, '北部出發', 'n'),
(2, '中部出發', 'c'),
(3, '東部出發', 'e'),
(4, '南部出發', 's');

-- --------------------------------------------------------

--
-- 資料表結構 `pd_rate`
--

CREATE TABLE `pd_rate` (
  `sid` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  `comment1` varchar(255) NOT NULL,
  `comment2` varchar(255) NOT NULL,
  `comment3` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `pd_rate`
--

INSERT INTO `pd_rate` (`sid`, `name`, `title`, `comment1`, `comment2`, `comment3`) VALUES
(1, '愛莉師', '台東熱氣球嘉年華', '很幸運的看到起飛的景象，超級美的', '狂拍照留念，第一站就佔了很多手機記憶體耶', '明年想要再帶我們家的小可愛來看！'),
(2, 'John', '露營區很棒', '可以跟三五好友帶著寵物來露營，真的是很棒的體驗', '營區還有特別準備寵物的食材，非常貼心！', '享受了一個完美的假期'),
(3, 'Lily Alien', '六十石山金針花海', '有非常充裕的時間可以在這裡狂殺底片', '這裡實在太美了！', '我跟我們家的寵物也陷入網美的世界了 (害羞)'),
(4, '蝦哩', '三天兩夜玩得超開心', '旅行社真的太貼心了，行程充裕不緊湊。', '跟自己的寵物體驗上山下海的行程很難得！', '在這裡認識好多狗友們，開心'),
(5, '木瓜人', '都歷海灘SUP', '之前在網路上看到別人分享和狗狗一起衝浪的體驗', '想不到今天我實現了！！！', '而且有專業教練的帶領，可以非常安心的盡興玩樂！'),
(6, 'Tom Cat', '住宿與食物', '旅行社選的住宿景點，對寵物都是非常的友善', '食物也會精心準備，完全不馬虎耶！吃得超開心', 'CP值超級高的行程，推推'),
(7, '柏拉圖', '值得體驗的行程', '浮潛真的太棒了，海底的珊瑚礁非常漂亮！', '天氣超熱，遊覽車絕對非常適合', '搭中巴環七美島，司機時間抓的很充裕，也都會解說'),
(8, 'Silver Gray', 'cp值頗高的單日旅遊', '我們這團才6人，所以旅遊品質超棒的啦！', '小烏來風景區可以從玻璃天空步道欣賞壯闊的瀑布景觀', '導遊大哥一路上很細心為我們解說，體貼友善'),
(9, '比利獸', '免裝備豪華露營', '第一次體會豪華露營，真的很不錯，營區環境很舒服', '暖東峽谷步道整理的很好，很適合全家大小一起去散步', '餐食很用心，吃的很豐盛，有機會會再去住一晚。'),
(10, 'Pitty Girl', '風景優美', '自備食材。環境乾淨舒適。 很棒的懶人露營', '提供的備品也都很齊全、設想周到 會推薦朋友來', '帶上寵物還能放鬆，讚！'),
(11, '阿蓉', '汪汪地瓜園控窯', '非常愉快的控窯體驗，食材非常的充足', '導覽哥哥講解的很生動，朋友都非常踴躍發言', '謝謝店家的用心讓我們渡過了愉快的週末！'),
(12, '迷唇妹', '麻雀雖小，五臟俱全', '食材豐盛好吃，環境乾淨舒適。', '店家細心解說流程，還預備了許多孩子能參與的活動', '環境非常好，腹地廣大，很適合帶毛孩一起去玩樂');

-- --------------------------------------------------------

--
-- 資料表結構 `pd_time`
--

CREATE TABLE `pd_time` (
  `sid` int(11) NOT NULL,
  `time` varchar(255) NOT NULL,
  `time_sid` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `pd_time`
--

INSERT INTO `pd_time` (`sid`, `time`, `time_sid`) VALUES
(1, '三日遊', 3),
(2, '二日遊', 2),
(3, '一日遊', 1),
(4, '活動', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `products`
--

CREATE TABLE `products` (
  `sid` int(11) NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `product_name1` varchar(255) NOT NULL,
  `product_name2` varchar(255) NOT NULL,
  `pd_short` varchar(255) NOT NULL,
  `pd_area` varchar(255) DEFAULT NULL,
  `cate` varchar(255) NOT NULL,
  `time` varchar(255) NOT NULL,
  `area` varchar(255) NOT NULL,
  `price_man` varchar(255) NOT NULL,
  `price_pet` varchar(255) NOT NULL,
  `price_all` varchar(255) NOT NULL,
  `star` varchar(255) NOT NULL,
  `rate` varchar(255) NOT NULL,
  `intro` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `products`
--

INSERT INTO `products` (`sid`, `product_name`, `product_name1`, `product_name2`, `pd_short`, `pd_area`, `cate`, `time`, `area`, `price_man`, `price_pet`, `price_all`, `star`, `rate`, `intro`) VALUES
(1, '上山下海玩得夠！｜熱氣球＆SUP＆金針花海 花東包車三日遊', '上山下海玩得夠！｜熱氣球＆', 'SUP＆金針花海 花東包車三日遊', '花東三日遊', '東部出發', '3', '48hr', 'e', '3280', '1000', '4280', '5.0', '178', '六十石山、赤科山、太麻里山為花東縱谷三大金針栽植區，賞金針花海的好去處。'),
(2, '你的瑜伽完美拍檔｜寵物也能完成的瑜伽 寵物初階瑜伽互動課程', '你的瑜伽完美拍檔｜寵物也能 ', '完成的瑜伽 寵物初階瑜伽互動課程', '瑜伽課程', '北部出發', '4', '3hr', 'n', '1140', '400', '1540', '4.8', '112', '寵物瑜伽：主人主動，狗狗被動。在瑜伽裡聲音是一種緩慢有規律的震動，會讓心平穩。'),
(3, '高雄寵物友善｜駁二草原盡情拍美照 & 狗民小學郊遊踏青參訪一日遊', '高雄寵物友善｜駁二草原盡情拍美照 & ', ' 狗民小學郊遊踏青參訪一日遊', '高雄一日遊', '南部出發', '1', '8hr', 's', '500', '200', '700', '4.8', '46', '活力豐沛駁二藝術特區是全台唯一有輕軌通過的文創園區，一起草原上奔跑拍照。'),
(4, '一起奔跑吧｜宜蘭露營 & 夜間觀星行程自由自在舒爽二日遊', '一起奔跑吧｜宜蘭露營 & 夜間觀星', '自由自在舒爽二日遊', '宜蘭二日遊', '北部出發', '2', '48hr', 'n', '1200', '800', '2000', '4.8', '200', '專人搭收所有設備！帶著簡單行李就能出發，體驗宜蘭在山谷中露營。'),
(5, '柴犬大集合遊台中｜彩虹眷村＆ 豐富公園跑跑跳跳心情好二日遊', '柴犬大集合遊台中｜彩虹眷村＆', '豐富公園跑跑跳跳心情好二日遊', '台中二日遊', '中部出發', '2', '48hr', 'c', '900', '500', '1400', '4.9', '273', '柴犬爸家們集合！一起猖狂遊台中景點，一起打破世界紀錄吧！'),
(6, '狗來富｜帶寵物同旅遊紫南宮＆玩遍深度探索南投風情三日遊', '狗來富｜帶寵物同旅遊紫南宮＆', '玩遍深度探索南投風情三日遊', '南投三日遊', '中部出發', '3', '72hr', 'c', '1888', '888', '2776', '4.6', '325', '戴上家中的富貴寵物，一同遊南投紫南宮，毛日獨家贈送寵物護身符，把富貴帶回家。'),
(7, '帶寵物遊澎湖｜ 菊島海產吃到痛風爽到發瘋二日遊（高雄出發）', '帶寵物遊澎湖｜ 菊島海產吃到痛風', '爽到發瘋二日遊（高雄出發）', '澎湖二日遊', '南部出發', '2', '48hr', 'n', '3650', '1800', '5450', '4.9', '442', '冬天的澎湖菊島也很精彩！帶上寵物走訪各大夢幻打卡點。'),
(8, '帶寵物高雄｜熱門打卡路線旗津老街＆愛河愛之船海陸雙吃二日遊', '帶寵物高雄｜熱門打卡路線旗津', '老街＆愛河愛之船海陸雙吃二日遊', '高雄二日遊', '南部出發', '2', '48hr', 's', '2560', '1480', '4040', '4.9', '124', '就是要跟寵物醬玩高雄，熱銷高雄經典行程，旅行專車與專業導遊，放心遊玩！'),
(9, 'busy歹吧郎ㄉ選擇｜陽明山二子坪＆熊空茶園一日遊', 'busy歹吧郎ㄉ選擇｜陽明山二', '子坪＆熊空茶園一日遊', '陽明山一日遊', '北部出發', '1', '8hr', 'n', '1500', '900', '2400', '4.8', '56', '寵物就是我男/女友！？帶上他們一起漫步陽明山與山峽台灣農林熊空茶園。'),
(10, '北市街拍｜專業司機包車載著你與毛小孩遊遍網美打卡景點一日遊', '北市街拍｜專業司機包車載著你', '與毛小孩遊遍網美打卡景點一日遊', '北市一日遊', '北部出發', '1', '8hr', 'n', '666', '360', '1026', '4.6', '434', '專業網紅帶領，台北各大網紅爭相打卡的私密景點，千萬不可錯過！'),
(11, '踏浪星辰露營｜寵物友善豪華露營懶人也能輕鬆體驗花蓮二日遊', '踏浪星辰露營｜寵物友善豪華露營', '懶人也能輕鬆體驗花蓮二日遊', '花蓮二日遊', '東部出發', '2', '48hr', 'n', '3200', '1260', '4460', '4.9', '234', '在花蓮無光害星海下入睡，早晨讓蟲鳴鳥叫喚醒，來趟放鬆身心靈的自然之旅。'),
(12, '與寶貝一起玩水之消暑不曬黑｜寵物友善森林水上遊樂區嗨翻天一日遊', '', '', '中部一日遊', '中部出發', '1', '8hr', 'c', '760', '350', '1110', '4.9', '124', '全園區皆能戴上寵物一起玩，森林擁有各式水上遊樂設施，專車接送，無煩惱旅行。'),
(13, 'GQ X 毛日｜毛爸毛媽動身嘍！快來參加寵物有善草地市集野餐日', '', '', '野餐一日遊', '中部出發', '1', '8hr', 'c', '900', '200', '1100', '4.7', '134', '毛日年度聯名活動，在華山大草原上與寵物一起野餐，當日還有課種體驗活動！'),
(14, '[ 毛日獨家 ] 寵物老是搗亂讓你又愛又氣嗎？｜寵物行為養成訓練速成課', '[ 毛日獨家 ] 寵物老是搗亂讓你又愛又氣嗎？', '[ 毛日獨家 ] 寵物老是搗亂讓你又愛又氣嗎？', '養成訓練課', '北部出發', '4', '4hr', 'n', '200', '600', '800', '4.8', '642', '由台大動物學教授暨寵物訓練師聯盟【偉偉老師】授課，了解毛寶貝的肢體語言。'),
(15, '[ 毛日好評 ] 寵物服裝DIY課｜零基礎沒問題！從打版教起適合新手毛爸媽們', '[ 毛日好評 ] 寵物服裝DIY課｜零基礎沒問題！從', '從打版教起適合新手毛爸媽們', '服裝課程', '北部出發', '4', '4hr', 'n', '1400', '100', '1500', '5.0', '452', '自己親手做的獨一無二，20年服裝經驗老師現場教學，新手也能快速上手！'),
(16, '寵物油畫｜與毛孩共同創作還能掛在家裡擺飾一舉兩得｜ Wendy老師授課', '寵物油畫｜與毛孩共同創作還能掛在家裡', '擺飾一舉兩得｜ Wendy老師授課', '油畫課程', '北部出發', '4', '2.5hr', 'n', '1150', '200', '1350', '4.8', '353', '毛小孩自己畫！帶毛孩一起來初體驗：主人當小畫家，寵物美容水噹噹！'),
(17, '[ 毛日獨家 ] 寵物放鬆精油調製｜由專業寵物香氛師及訓練師帶領的精油氣味課', '[ 毛日獨家 ] 寵物放鬆精油調製｜由專業寵物香氛師', '及訓練師帶領的精油氣味課', '香氛課程', '北部出發', '4', '2hr', 'n', '1200', '300', '1500', '4.9', '56', '現場調製出1 瓶適合自己與寵物的精油（30ml），讓放鬆香味回韻在家中。'),
(18, '聖誕老公公都想吃的寵物餅乾｜與毛家長們一起製作自己寶貝的造型餅乾', '聖誕老公公都想吃的寵物餅乾｜與毛家長', '們一起製作自己寶貝的造型餅乾', '寵物餅乾課程', '北部出發', '4', '4hr', 'n', '550', '100', '650', '4.7', '262', '十二月幸福季節， 不可少的寵物造型聖誕餅乾DIY限時開課！'),
(19, '跨年party寵物不孤單｜寵物一起加入瘋跨年全家一起嗨明天才會嗨', '跨年party寵物不孤單｜寵物一起', '加入瘋跨年全家一起嗨明天才會嗨', '跨年活動', '北部出發', '4', '8hr', 'n', '1600', '600', '2200', '4.8', '183', '不需人擠人！直接包下信義區CR&G 78樓觀景台帶上心愛寵物一起跨年。'),
(20, '[ 熱烈招生中 ] 動手做食器 ｜寵物也能一同參與的寵物食器 DIY 活動課程', '[ 熱烈招生中 ] 動手做食器 ｜寵物也能一同', '參與的寵物食器 DIY 活動課程', '食器課程', '北部出發', '4', '3hr', 'n', '1280', '300', '1580', '4.8', '74', '立即預約peliday毛孩教室，專業師傅教學帶領製作陶瓷食器，適合親子一起體驗'),
(21, '你就是寵物的大廚｜寵物鮮食烹飪 & 營養知識教學課程｜ Jimmy老師授課', '你就是寵物的大廚｜寵物鮮食烹飪 & ', '營養知識教學課程｜ Jimmy老師授課', '烹飪課程', '北部出發', '4', '3hr', 'n', '990', '300', '1290', '4.9', '209', '透過營養師協助規劃後的鮮食，幫助飼主在家也能輕鬆備餐，寶貝天天吃得健康美味又營養'),
(22, '東部樂活綠油行｜台東伯朗大道 & 初鹿牧場親近自然放鬆眼睛二日遊', '', '', '東部二日遊', '東部出發', '2', '48hr', 'e', '2980', '1200', '4180', '4.6', '192', '沿海處處是美景，山川壯麗美不勝收，得天獨厚大自然的資源豐富，連假放鬆的美好去處'),
(23, '和寵物沁涼一夏｜澎湖玄武岩 & 七美雙心石滬經典必去景點三日遊', '', '', '澎湖三日遊', '東部出發', '3', '72hr', 'e', '4270', '1800', '6070', '4.8', '38', '現在訂購沙灘透明獨木舟 / SUP 行程，由專業教練帶領體驗，與毛小孩一同划舟'),
(24, '寵物陪你血拼到手軟｜桃園華泰名品城 & 春天農場豐富一日遊', '寵物陪你血拼到手軟｜桃園華泰名品城 &', '春天農場豐富一日遊', '血拼一日遊', '北部出發', '1', '8hr', 'n', '780', '300', '1080', '4.8', '174', '帶你探索華泰名品城的各式生活主題，與毛孩也能輕鬆愉悅地享受購物樂趣。'),
(25, '手牽狗去散步｜墾丁龍磐公園 & 小巴里島岩一靜一動剛剛好一日遊', '手牽狗去散步｜墾丁龍磐公園 & ', '小巴里島岩一靜一動剛剛好一日遊', '墾丁一日遊', '南部出發', '1', '8hr', 's', '999', '600', '1599', '4.3', '88', '放假來屏東一日遊玩，屏東有哪些好玩的地方，來趟屏東輕旅行感受一下在地的自然風光。'),
(26, '誰是最厲害的狗狗！｜寵物親子趣味競賽三合一一日活動', '', '', '趣味競賽', '中部出發', '4', '5hr', 'c', '399', '400', '799', '4.6', '67', '本次活動特別規劃了三場的寵物趣味競賽，歡迎市民朋友帶著毛小孩們一同共襄盛舉。'),
(27, '陪你過假日｜基隆和平島公園野餐 & 市集 & 講座 & 音樂會', '陪你過假日｜基隆和平島公園野餐 & ', '陪你過假日｜基隆和平島公園野餐 & ', '基隆一日遊', '北部出發', '4', '8hr', 'n', '680', '600', '1280', '4.3', '98', '在大自然的擁抱下，聆聽毛孩音樂、逛逛選物市集，只要和毛孩一起，做什麼都好快樂！'),
(28, '北海岸必去打卡點｜陰陽海＆老梅綠石槽＆象鼻岩一日遊', '北海岸必去打卡點｜陰陽海＆', '老梅綠石槽＆象鼻岩一日遊', '北海岸一日遊', '北部出發', '1', '10hr', 'n', '890', '400', '1290', '4.5', '239', '包車漫遊台灣北海岸，輕鬆遊走於北海岸熱門網拍景點如老梅綠石槽、鼻頭角和陰陽海'),
(29, '苗栗樂活古風行｜南庄老街 & 景觀莊園 & 寵物主題旅館二日遊', '', '', '苗栗二日遊', '中部出發', '2', '48hr', 'c', '2450', '1000', '3450', '4.5', '29', '民宿在南庄山區占地寬廣，帶著狗狗旅行輕鬆安心愜意，還可與狗友們交流照顧心得。'),
(30, '狗狗也想當網美｜台南藍晒圖文創園區 & 台江國家公園三日遊', '狗狗也想當網美｜台南藍晒圖文創園區 &', ' 台江國家公園三日遊', '台江三日遊', '南部出發', '3', '72hr', 's', '4780', '1360', '6140', '4.9', '75', '巴克禮公園是台南之肺，公園裡常見到主人帶著毛孩散步在林間，如國外景致般的悠閒。'),
(31, '毛孩生日快樂！｜專為你家寶貝安排的寵物壽星派對活動', '毛孩生日快樂！｜專為你家寶貝安排', '的寵物壽星派對活動', '生日活動', '北部出發', '4', '3hr', 'n', '499', '777', '1276', '4.9', '398', '生日派對讓寵物備感關愛和重視，蛋糕口味可依毛孩所需的營養及需求設計。'),
(32, '寵物也能體驗的異國風情｜宜蘭南方澳內埤海 & 三奇村二日遊', '寵物也能體驗的異國風情｜宜蘭南方澳', '內埤海 & 三奇村二日遊', '宜蘭二日遊', '北部出發', '2', '48hr', 'n', '3120', '1200', '4320', '4.5', '222', '台東有金城武樹的伯朗大道，宜蘭冬山鄉三奇村也有一條無電線桿的「宜蘭伯朗大道」'),
(33, '毛孩的新樂園｜水管屋寵物樂園：南投右下四角村寵物樂活一日遊', '', '', '樂園一日遊', '中部出發', '1', '8hr', 'c', '1520', '980', '2500', '4.8', '109', '「右下四角村」樂園皆以狗狗們為出發點，還有讓主人能跟寵物同住的粉嫩繽紛水管屋。'),
(34, '帶著毛孩購物趣｜高雄寵物展 & 網美咖啡廳輕鬆悠閒文青一日遊', '帶著毛孩購物趣｜高雄寵物展 & ', '網美咖啡廳輕鬆悠閒文青一日遊', '高雄一日遊', '南部出發', '1', '6hr', 's', '650', '500', '1150', '4.2', '95', '集結各大寵物商聯手下殺，飼料、玩具、保健用品一應俱全！快帶毛小孩一起來玩吧！');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `index-quiz`
--
ALTER TABLE `index-quiz`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `member-wishlist`
--
ALTER TABLE `member-wishlist`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `member_avatar`
--
ALTER TABLE `member_avatar`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `member_orders`
--
ALTER TABLE `member_orders`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `member_pet`
--
ALTER TABLE `member_pet`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `order-man`
--
ALTER TABLE `order-man`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `order-pet`
--
ALTER TABLE `order-pet`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `order_details`
--
ALTER TABLE `order_details`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `order_list`
--
ALTER TABLE `order_list`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `pd_area`
--
ALTER TABLE `pd_area`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `pd_rate`
--
ALTER TABLE `pd_rate`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `pd_time`
--
ALTER TABLE `pd_time`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `index-quiz`
--
ALTER TABLE `index-quiz`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `member-wishlist`
--
ALTER TABLE `member-wishlist`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `member_avatar`
--
ALTER TABLE `member_avatar`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `member_orders`
--
ALTER TABLE `member_orders`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `member_pet`
--
ALTER TABLE `member_pet`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `order-man`
--
ALTER TABLE `order-man`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `order-pet`
--
ALTER TABLE `order-pet`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `order_details`
--
ALTER TABLE `order_details`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=71;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `order_list`
--
ALTER TABLE `order_list`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2020126685;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `pd_area`
--
ALTER TABLE `pd_area`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `pd_rate`
--
ALTER TABLE `pd_rate`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `pd_time`
--
ALTER TABLE `pd_time`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products`
--
ALTER TABLE `products`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
